<script lang="ts"> 
    import { onMount } from 'svelte';   

    let faqs = [
        { id: 1, title: "Είναι ασφαλή τα δεδομένα μου;", answer: "Η φιλοσοφία μας είναι: ό,τι γίνεται στη συσκευή σου, μένει στη συσκευή σου. Αναπτύξαμε την εφαρμογή με μεθόδους και τεχνολογίες που διατηρούν τα δεδομένα σου ασφαλή και μόνο δικά σου. Τα στοιχεία σύνδεσης, τα προσωπικά δεδομένα και οι επιδόσεις σου είναι προσβάσιμα μόνο από εσένα και τις επίσημες υπηρεσίες του ΑΠΘ \(students.auth.gr, elearning.auth.gr κ.α.)."},
        { id: 2, title: "Πώς η εφαρμογή διαχειρίζεται τα δεδομένα μου;", answer: "Η εφαρμογή αποτελεί ένα συνεχώς αναπτυσσόμενο ανοιχτό λογισμικό. Ολόκληρος ο κώδικας είναι πάντα διαθέσιμος online <a href=https://github.com/acmauth/StudentCompanion>εδώ</a>, όπου μπορείς να τον μελετήσεις και να προτείνεις αλλαγές ή επεκτάσεις."},
        { id: 3, title: "Γιατί να χρησιμοποιήσω το Aristomate;", answer: "Η εφαρμογή αναπτύχθηκε για να καλύψει μια μεγάλη και προβληματική έλλειψη ολοκλήρωσης στα πληροφοριακά συστήματα του πανεπιστημίου. Δεν είναι κουραστικό να επισκέπτεσαι άλλη ιστοσελίδα για τους βαθμούς και τα στατιστικά σου και άλλη σελίδα για να ελέγξεις αν ανακοινώθηκε κάτι σε ένα μάθημα; Με το Aristomate η εναλλαγή αυτή γίνεται με το πάτημα ενός μόλις κουμπιού!"},
        { id: 4, title: "Τι μπορώ να κάνω με το Aristomate;", answer: "<ul><li>Προβολή αναλυτικής βαθμολογίας και στατιστικών επιδόσεων μαθημάτων</li><li>Πρόβλεψη μεταβολής μέσου όρου με βάση προσωπικές εκτιμήσεις βαθμολογιών</li><li>Προβολή προγράμματος διαλέξεων και εξετάσεων</li><li>Δημιουργία προγράμματος μαθημάτων, προόδων και εργασιών</li><li>Προβολή μενού φοιτητικής λέσχης</li><li>Προβολή χάρτη του campus</li><li>Προβολή πληροφοριών φοιτητή</li><li>Προβολή ενημερώσεων από students.auth.gr και elearning.auth.gr</li><li>Προβολή χρήσιμων υπερσυνδέσμων προς ιστοτόπους του ΑΠΘ</li></ul>" },
        { id: 5, title: "Μπορώ να προτείνω κάτι για την εφαρμογή;", answer: "Εννοείται! Θα χαρούμε να ακούσουμε τις ιδέες σου, μπορείς να μας στείλεις ένα μέιλ στο <a href='mailto:aristomate@auth.acm.org'>aristomate@auth.acm.org</a> ή να γίνεις και μέλος του chapter της acm για να τα συζητήσουμε και από κοντά! " },
        { id: 6, title: "Μπορώ να κάνω δήλωση μαθημάτων ή υποβολή εργασιών;", answer: "Δυστυχώς, δεν είναι ακόμη δυνατή η δήλωση μαθημάτων ή η υποβολή εργασιών μέσω της εφαρμογής. Παράμεινε συντονισμένος για ενημερώσεις!" },
        { id: 7, title: "Εντόπισα λάθος στα δεδομένα της εφαρμογής. Τι κάνω; ", answer: "Οι πληροφορίες για τα μαθήματα, τις επιδόσεις σου και τα προσωπικά σου στοιχεία λαμβάνονται από κατάλληλα συστήματα του ΑΠΘ. Η διαλειτουργικότητα μεταξύ συστημάτων πάντα ενέχει την πιθανότητα ελλείψεων ή παραλλαγμένης παρουσίασης των δεδομένων. Αν σε προβληματίζει κάτι που βλέπεις στην εφαρμογή, βασίσου στις πληροφορίες που παρουσιάζονται online απευθείας από το πανεπιστήμιο. Ωστόσο, θα μας βοηθούσε πολύ να επικοινωνήσεις μαζί μας στο <a href='mailto:aristomate@auth.acm.org'>aristomate@auth.acm.org</a> για να μας περιγράψεις το πρόβλημα!" },
    ];

    function toggleFullTitle(faq) {
    faq.showFullTitle = !faq.showFullTitle;
  }

    onMount(() => {
        faqs.forEach(faq => {
        const answerDiv = document.getElementById(`faq-answer-${faq.id}`);
        answerDiv.innerHTML = faq.answer;
        });
    });
</script>

<!-- FAQ.svelte -->
<ion-content class="ion-padding">
    <ion-accordion-group expand="inset">
        {#each faqs as faq}
            <ion-accordion value={faq.id.toString()}>
            <ion-item slot="header" color="light" style="padding: 0;">
                <ion-text style="display: block; font-size: 15px;">{faq.title}</ion-text>
            </ion-item>
            <div class="ion-padding" slot="content" style="font-size: 15px;">
                <div id="faq-answer-{faq.id}" class="faq-answer"></div>
            </div>
            </ion-accordion>
        {/each}
        </ion-accordion-group>       
</ion-content>

  
<style>

</style>

